In [1]:
import pandas as pd
import numpy as np

In [2]:
# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [4]:
# Create a dictionary with the data given above
dat = {'Book Title' : books,
       'Author' : authors,
       'User 1' : user_1,
       'User 2' : user_2,
       'User 3' : user_3,
       'User 4' : user_4}

dat

{'Book Title': 0     Great Expectations
 1        Of Mice and Men
 2       Romeo and Juliet
 3       The Time Machine
 4    Alice in Wonderland
 dtype: object, 'Author': 0        Charles Dickens
 1         John Steinbeck
 2    William Shakespeare
 3            H. G. Wells
 4          Lewis Carroll
 dtype: object, 'User 1': 0    3.2
 1    NaN
 2    2.5
 dtype: float64, 'User 2': 0    5.0
 1    1.3
 2    4.0
 3    3.8
 dtype: float64, 'User 3': 0    2.0
 1    2.3
 2    NaN
 3    4.0
 dtype: float64, 'User 4': 0    4.0
 1    3.5
 2    4.0
 3    5.0
 4    4.2
 dtype: float64}

In [10]:
book_ratings = pd.DataFrame(dat)
book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     NaN     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     NaN     4.0
3     The Time Machine          H. G. Wells     NaN     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     NaN     NaN     NaN     4.2

In [11]:
size = pd.DataFrame(dat).shape
size

(5, 6)

In [14]:
book_ratings.fillna(book_ratings.mean(), inplace = True)
book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     2.9     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     2.8     4.0
3     The Time Machine          H. G. Wells     2.9     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     2.9     3.5     2.8     4.2

In [15]:
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values

In [16]:
best_rated

array(['Great Expectations', 'The Time Machine'], dtype=object)

In [32]:
##The issue I have with this method of finding the best rated above is that it just locates the number 5. 
##I would like to run a selection of the book with the highest average to see which then has the best rating
##I do not know how to do that and I am short on time. I may come back to this problem later
best_rated2 = book_ratings.mean()
best_rated2

User 1    2.9
User 2    3.5
User 3    2.8
User 4    4.1
dtype: float64

In [29]:
best_ratedDF = pd.DataFrame(best_rated2)
best_ratedDF

          0
User 1  2.9
User 2  3.5
User 3  2.8
User 4  4.1